init.org
#+TITLE: Emacs Configuration
#+AUTHOR: ddksr
#+OPTIONS: toc:3 num:nil ^:nil

* Basic information

** System requirements
- aspell, aspell-en

*** Javascript

*** Go

*** Python

** Usage

To compile, run:
#+begin_src
M-x org-babel-tangle
#+end_src

** Keybindings principles

- Bind only what you use
- Use helpers (like hydra) to help remember the bindings

| KEY GROUP | DESCRIPTION                                                            |
|-----------+------------------------------------------------------------------------|
| s-y ###   | Buffer common actions                                                  |
| s-a ###   | Editor common actions                                                  |
| s-x # ### | Mode hydras and shortcuts                                              |
|-----------+------------------------------------------------------------------------|
| C-###     | Text manipulation - needs to be quick and might be multi-pressed       |
| s-###     | Other manipulation, that needs to be quick and might be multi-pressed. |
|           | Should generally be avoided since OS usually binds these.              |
|-----------+------------------------------------------------------------------------|
| C-M-###   | AVOID, since it's always connected to the OS.                          |
|-----------+------------------------------------------------------------------------|
| C-c ###   | Major mode specific key bindings                                       |


* Essentials
#+BEGIN_SRC emacs-lisp :tangle yes
  (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (setq debug-on-error nil)

  (setf epa-pinentry-mode 'loopback)
  (setq byte-compile-warnings '(not free-vars mapcar suspicious obsolete))

  (setq custom-file (concat user-emacs-directory "etc/custom.el"))
  (load custom-file)
#+END_SRC

* TODO Identity

#+BEGIN_SRC emacs-lisp :tangle yes
  ; is server running?
  ; is init server?
#+END_SRC

* Variables
Personal information
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq own/nick ""
        own/full-name ""
        own/email "")
#+END_SRC

Local environment
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq own/initial-buffer "~/.emacs.d/welcome"
        own/is-nox nil ; if it's not run in tty
        own/emacs-d-dirs '("lib/")
        own/yas-dirs '("~/.emacs.d/snippets" "~/.emacs.d/snippets-private")
        own/org-dir nil
        own/org-dir-agenda nil
        own/roam-dir "~/notes"
        own/py-venvs "~/.virtualenvs"
        own/go-path "~/env/go"
        own/npm-path "~/.nvm/versions/node/v8.9.4/bin/")
#+END_SRC

Settings
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq own/enable-themes nil
        own/enable-php nil
        own/enable-go nil
        own/enable-js nil
        own/enable-python nil)
#+END_SRC

* Basic functions
Load configuration file
#+begin_src emacs-lisp :tangle yes
  (defun own/etc-load (file)
    (let ((etc-path (concat user-emacs-directory "etc/" file)))
          (message etc-path)
          (if (file-exists-p etc-path)
                  (progn
                    (load-file etc-path)
                    t)
            nil)))
#+end_src

Shutdown Emacs
#+begin_src emacs-lisp :tangle yes
  (defun own/shutdown ()
    "Save buffers, Quit, and Shutdown (kill) server"
    (interactive)
    (save-some-buffers)
    (kill-emacs)
    )
#+end_src

* Load path, privates and packages
** Add directories to load path
#+BEGIN_SRC emacs-lisp :tangle yes
(mapcar #'(lambda (dir)
		   (add-to-list 'load-path (concat user-emacs-directory dir)))
		own/emacs-d-dirs)
#+END_SRC

** Load private configuration
Load privates that will overwrite global variables
#+begin_src emacs-lisp :tangle yes
(unless (own/etc-load "private.el.gpg")
  (own/etc-load "private.el"))
#+end_src

** Load packages

#+begin_src emacs-lisp :tangle yes
  (require 'package)
  (setq use-package-verbose t)
  (unless (assoc-default "melpa" package-archives)
    (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
  (unless (assoc-default "nongnu" package-archives)
    (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t))
#+end_src

*** First run
#+BEGIN_SRC emacs-lisp :tangle yes
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+END_SRC

*** Essential packages
All use-package related packages that are used in all other configurations.
#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-when-compile
    (require 'use-package))
  (use-package hydra
    :ensure t)
  (use-package diminish
    :ensure t)
  (use-package use-package-hydra
    :after hydra
    :ensure t)
  (require 'diminish)
  (require 'bind-key)
#+END_SRC

* Basic configuration
** Global preferences
Remove backup files and add an new empty line at the end of each file.
#+begin_src emacs-lisp :tangle yes
  (setq make-backup-files nil ; Disable backup files
        next-line-add-newlines t) ; Make newline at the bottom
#+end_src

Disable default features
#+begin_src emacs-lisp :tangle yes
  (global-unset-key [(up)])
  (global-unset-key [(down)])
  (global-unset-key [(left)])
  (global-unset-key [(right)])
  (global-unset-key [(prior)])
  (global-unset-key [(next)])
  (global-unset-key [(home)])
  (global-unset-key [(next)])
  (global-unset-key (kbd "<C-left>"))
  (global-unset-key (kbd "<C-right>"))
  (global-unset-key (kbd "<C-up>"))
  (global-unset-key (kbd "<C-down>"))
  (global-unset-key (kbd "<M-left>"))
  (global-unset-key (kbd "<M-right>"))
  (global-unset-key (kbd "<M-up>"))
  (global-unset-key (kbd "<M-down>"))
#+end_src

Adjust default behavior
#+begin_src emacs-lisp :tangle yes
  (define-key global-map (kbd "RET") 'newline-and-indent) ; indent after RETURN
#+end_src

** Appearance
Buffer
#+begin_src emacs-lisp :tangle yes
  (global-display-line-numbers-mode 1)
  (dolist (mode '(org-mode-hook term-mode-hook eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (setq uniquify-buffer-name-style 'forward
        uniquify-separator "/"
        uniquify-after-kill-buffer-p t    ; rename after killing uniquified
        uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers
#+end_src

** UX
Don't use yes-or-no but y-or-n because it's faster !!
#+begin_src emacs-lisp :tangle yes
  (fset 'yes-or-no-p 'y-or-n-p)
  (setq confirm-nonexistent-file-or-buffer nil)
  (setq inhibit-startup-message t
        inhibit-startup-echo-area-message t)
  (setq kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))
  (tooltip-mode -1)
  (setq tooltip-use-echo-area t)
#+end_src
Adjust whitespace mode
- display whitespaces when using whitespace mode
- use basic coloring
#+begin_src emacs-lisp :tangle yes
  (setq whitespace-display-mappings
         ;; all numbers are Unicode codepoint in decimal. try (insert-char 182 ) to see it
        '(
          (space-mark 32 [183] [46]) ; 32 SPACE, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
          (newline-mark 10 [182 10]) ; 10 LINE FEED
          (tab-mark 9 [9655 9] [92 9]) ; 9 TAB, 9655 WHITE RIGHT-POINTING TRIANGLE 「▷」
          ))

  ;; make whitespace-mode use just basic coloring
  (setq whitespace-style (quote (spaces tabs newline space-mark tab-mark newline-mark)))
#+end_src

** Spaces and tabs
Only use spaces with witdh 4
#+begin_src emacs-lisp :tangle yes
(setq-default indent-tabs-mode nil)
(setq default-tab-width 4
	  tab-width 4
      c-basic-offset 4) ;; use only tabs and no spaces
#+end_src

** Lines
Wrapping lines
#+begin_src emacs-lisp :tangle yes
(setq truncate-lines nil)
(setq fill-column 80)
(add-hook 'text-mode-hook '(lambda ()
    (setq truncate-lines nil
          word-wrap t)))
(add-hook 'prog-mode-hook '(lambda ()
    (setq truncate-lines nil
          word-wrap nil)))
#+end_src

** Themes
#+begin_src emacs-lisp :tangle yes
  (use-package doom-themes
    :if own/enable-themes

    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-dracula t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    :ensure t)
#+end_src

* Helper functions
