init.el
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(setq debug-on-error nil)

(setf epa-pinentry-mode 'loopback)
(setq byte-compile-warnings '(not free-vars mapcar suspicious obsolete))

(setq custom-file (concat user-emacs-directory "etc/custom.el"))
(load custom-file)

; is server running?
; is init server?

(setq own/nick ""
      own/full-name ""
      own/email "")

(setq own/initial-buffer "~/.emacs.d/welcome"
      own/is-nox nil ; if it's not run in tty
      own/emacs-d-dirs '("lib/")
      own/yas-dirs '("~/.emacs.d/snippets" "~/.emacs.d/private-snippets")
      own/org-dir nil
      own/roam-dir "~/notes"
      own/py-venvs "~/.virtualenvs"
      own/go-path "~/env/go")

(setq own/enable-themes t
      own/enable-php t
      own/enable-go t
      own/enable-js nil
      own/enable-python t)

(defun own/etc-load (file)
  (let ((etc-path (concat user-emacs-directory "etc/" file)))
        (message etc-path)
        (if (file-exists-p etc-path)
                (progn
                  (load-file etc-path)
                  t)
          nil)))

(defun own/shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server"
  (interactive)
  (save-some-buffers)
  (kill-emacs)
  )

(mapcar #'(lambda (dir)
		   (add-to-list 'load-path (concat user-emacs-directory dir)))
		own/emacs-d-dirs)

(unless (own/etc-load "private.el.gpg")
  (own/etc-load "private.el"))

(require 'package)
(setq use-package-verbose t)
(unless (assoc-default "melpa" package-archives)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
(unless (assoc-default "nongnu" package-archives)
  (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))
(use-package hydra
  :ensure t)
(use-package diminish
  :ensure t)
(use-package use-package-hydra
  :after hydra
  :ensure t)
(require 'diminish)
(require 'bind-key)

(setq make-backup-files nil ; Disable backup files
      next-line-add-newlines t) ; Make newline at the bottom

(global-unset-key [(up)])
(global-unset-key [(down)])
(global-unset-key [(left)])
(global-unset-key [(right)])
(global-unset-key [(prior)])
(global-unset-key [(next)])
(global-unset-key [(home)])
(global-unset-key [(next)])
(global-unset-key (kbd "<C-left>"))
(global-unset-key (kbd "<C-right>"))
(global-unset-key (kbd "<C-up>"))
(global-unset-key (kbd "<C-down>"))
(global-unset-key (kbd "<M-left>"))
(global-unset-key (kbd "<M-right>"))
(global-unset-key (kbd "<M-up>"))
(global-unset-key (kbd "<M-down>"))

(define-key global-map (kbd "RET") 'newline-and-indent) ; indent after RETURN

(global-display-line-numbers-mode 1)
(dolist (mode '(org-mode-hook term-mode-hook eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq uniquify-buffer-name-style 'forward
      uniquify-separator "/"
      uniquify-after-kill-buffer-p t    ; rename after killing uniquified
      uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers

(fset 'yes-or-no-p 'y-or-n-p)
(setq confirm-nonexistent-file-or-buffer nil)
(setq inhibit-startup-message t
      inhibit-startup-echo-area-message t)
(setq kill-buffer-query-functions
      (remq 'process-kill-buffer-query-function
            kill-buffer-query-functions))
(tooltip-mode -1)
(setq tooltip-use-echo-area t)

(setq whitespace-display-mappings
       ;; all numbers are Unicode codepoint in decimal. try (insert-char 182 ) to see it
      '(
        (space-mark 32 [183] [46]) ; 32 SPACE, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
        (newline-mark 10 [182 10]) ; 10 LINE FEED
        (tab-mark 9 [9655 9] [92 9]) ; 9 TAB, 9655 WHITE RIGHT-POINTING TRIANGLE 「▷」
        ))

;; make whitespace-mode use just basic coloring
(setq whitespace-style (quote (spaces tabs newline space-mark tab-mark newline-mark)))

(setq-default indent-tabs-mode nil)
(setq default-tab-width 4
	  tab-width 4
      c-basic-offset 4) ;; use only tabs and no spaces

(setq truncate-lines nil)
(setq fill-column 80)
(add-hook 'text-mode-hook '(lambda ()
    (setq truncate-lines nil
          word-wrap t)))
(add-hook 'prog-mode-hook '(lambda ()
    (setq truncate-lines nil
          word-wrap nil)))

(use-package doom-themes
  :if own/enable-themes

  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-dracula t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)
  :ensure t)
