init.org
** Windows & Buffers
#+begin_src emacs-lisp :tangle yes
  (defun own/delete-current-buffer-file ()
    "Removes file connected to current buffer and kills buffer."
    (interactive)
    (let ((filename (buffer-file-name))
          (buffer (current-buffer))
          (name (buffer-name)))
      (if (not (and filename (file-exists-p filename)))
          (ido-kill-buffer)
        (when (yes-or-no-p "Are you sure you want to remove this file? ")
          (delete-file filename)
          (kill-buffer buffer)
          (message "File '%s' successfully removed" filename)))))
  (defun own/rename-current-buffer-file ()
    "Renames current buffer and file it is visiting."
    (interactive)
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (if (not (and filename (file-exists-p filename)))
          (error "Buffer '%s' is not visiting a file!" name)
        (let ((new-name (read-file-name "New name: " filename)))
          (if (get-buffer new-name)
              (error "A buffer named '%s' already exists!" new-name)
            (rename-file filename new-name 1)
            (rename-buffer new-name)
            (set-visited-file-name new-name)
            (set-buffer-modified-p nil)
            (message "File '%s' successfully renamed to '%s'"
                     name (file-name-nondirectory new-name)))))))
  (defun own/show-filename ()
    "Show the full path file name in the minibuffer."
    (interactive)
    (message (buffer-file-name)))
#+end_src

** External
#+begin_src emacs-lisp :tangle yes
(defun own/google-search ()
  "Googles a query or region if any."
  (interactive)
  (browse-url
   (concat
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
    (if mark-active
        (buffer-substring (region-beginning) (region-end))
      (read-string "Google: ")))))
(defun own/goto-url ()
  "Open browser"
  (interactive)
  (browse-url 
	 (concat "http://" (read-string "URL: ") )))
#+end_src

** Misc

#+begin_src emacs-lisp :tangle yes
(defun own/flatten (mylist)
  (cond
   ((null mylist) nil)
   ((atom mylist) (list mylist))
   (t
    (append (own/flatten (car mylist)) (own/flatten (cdr mylist))))))
#+end_src

* Hooks
** Programming
Mark FIXME, SIGITODO, TODO and BUG
#+begin_src emacs-lisp :tangle yes
  (defun own/hook-mark-todo () 
    "A hook that sets bold reserved words FIXME, SIGITODO, TODO and BUG"
    (font-lock-add-keywords nil
                            '(("\\<\\(FIXME\\|SIGITODO\\|TODO\\|BUG\\):"
                               1 font-lock-warning-face t))))

#+end_src

* Packages
** Global
*** Auto-compile
Two minor modes which automatically recompile Emacs Lisp source files. Together these modes guarantee that Emacs never loads outdated byte code files.
#+begin_src emacs-lisp :tangle yes
  (use-package auto-compile
    :init
    (auto-compile-on-load-mode 1)
    (auto-compile-on-save-mode 1)
    :ensure t)
#+end_src
*** Selectrum
Better minibuffer
#+begin_src emacs-lisp :tangle yes
  (use-package selectrum
    :init
    (selectrum-mode +1)
    :ensure t)
  (use-package prescient
    :ensure t)
  (use-package selectrum-prescient
    :init
    (selectrum-prescient-mode +1) ; use prescient for minibuffer completion
    (prescient-persist-mode +1) ; remember favorite selections
    :after (selectrum prescient)
    :ensure t)
#+end_src
*** Undo
Undo tree visualization
#+begin_src emacs-lisp :tangle yes
  (use-package undo-tree
    :custom
    (undo-tree-auto-save-history nil)
    :init
    (global-undo-tree-mode)
    :ensure t)
#+end_src
*** rg
Better grep
#+begin_src emacs-lisp :tangle yes
  (use-package rg
    :config
    (grep-apply-setting 'grep-template "rg --no-heading -H -uu -g <F> <R> <D>")
    :ensure t)
#+end_src

*** Expand region
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :bind ("C-<" . er/expand-region)
    :ensure t)
#+end_src

*** Git gutter
Git symbols (additions, deletions) in buffer. Two versions because of complications with line numbers.
#+begin_src emacs-lisp :tangle yes
  (use-package git-gutter
;    :if own/is-nox
    :init
    (global-git-gutter-mode +1)
    :ensure t)
;  (use-package git-gutter-fringe
;    :unless own/is-nox
;    :init
;    (global-git-gutter-mode +1)
;    :ensure t)
#+end_src

*** Yasnippet
Helpful snippets

#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :config
    ;(define-key yas-minor-mode-map (kbd "<tab>") nil)
    ;(define-key yas-minor-mode-map (kbd "TAB") nil)
    (setq yas-snippet-dirs (append (yas-snippet-dirs)
                                   own/yas-dirs))
    (yas/global-mode 1)
    :ensure t)
#+end_src

*** Company
#+begin_src emacs-lisp :tangle yes
  (use-package company
    :config
    (add-hook 'after-init-hook 'global-company-mode)
    :ensure t)
#+end_src

** Appearance
*** Rainbow delimiters
#+begin_src emacs-lisp :tangle yes
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)
    :ensure t)
#+end_src

*** Volatile highlights
Highlight pastes and other things
#+begin_src emacs-lisp :tangle yes
  (use-package volatile-highlights
    :init
    (volatile-highlights-mode t)
    :ensure t)
#+end_src

*** Modeline
Trying out doom modeline (instead of powerline).
Using also diminish for minimalism (icons instead of names).

#+begin_src emacs-lisp :tangle yes
  (use-package doom-modeline
    :config
    (doom-modeline-mode 1)
    :ensure t)
#+end_src

** Text

*** Spelling
#+begin_src emacs-lisp :tangle yes
  (use-package flyspell-lazy
    :config
    (flyspell-lazy-mode 1)
    (flyspell-mode 1) 
    :ensure t)
#+end_src

*** Multiselect
#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C-S-s" . mc/mark-next-like-this)
           ("C-S-r" . mc/mark-previous-like-this)
           ("C-S-a" . mc/mark-all-like-this))
    :ensure t)
#+end_src

** Tools

*** Projectile
#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :config
    (projectile-mode +1)
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    :ensure t)
#+end_src

*** Magit
#+begin_src emacs-lisp :tangle yes
  (use-package magit
    :bind ("C-x C-g" . magit-status)
    :ensure t)
#+end_src

*** ORG
Org is built-in now so no use-package.
#+begin_src emacs-lisp :tangle yes
  (setq org-log-done t
        org-agenda-files (own/flatten (mapcar 'file-expand-wildcards (own/flatten own/org-agenda-files)))
        org-directory own/org-dir
        org-src-fontify-natively t)
  (bind-key "s-x o a" 'org-agenda)
#+end_src

*** ORG Roam
#+begin_src emacs-lisp :tangle yes
  (use-package org-roam
    :custom
    (org-roam-directory (file-truename own/roam-dir))
    :bind (("s-x n" . hydra-roam/body)
           ("C-đ C-đ" . org-roam-dailies-goto-today)
           ("C-š C-š" . org-roam-node-insert)
           ("C-đ C-š" . org-roam-buffer-toggle)
           ("C-š C-đ" . org-roam-capture))
    :hydra (hydra-roam (:color blue :hint nil :exit t)
                       ("b" org-roam-buffer-toggle "Toggle")
                       ("f" org-roam-node-find "Find")
                       ("g" org-roam-graph "Graph")
                       ("i" org-roam-node-insert "Insert")
                       ("c" org-roam-capture "Capture")

                       ("t" org-roam-dailies-capture-today "Capture today")
                       ("T" org-roam-dailies-goto-today "Today notes")
                       ("j" org-roam-dailies-capture-tomorrow "Capture tomorrow")
                       ("J" org-roam-dailies-goto-tomorrow "Tomorrow notes")
                       ("y" org-roam-dailies-capture-yesterday "Capture yesterday")
                       ("Y" org-roam-dailies-goto-yesterday "Yesterday notes")
                       ("d" org-roam-dailies-capture-date "Capture date")
                       ("D" org-roam-dailies-goto-date "Daily notes"))
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    ;; If using org-roam-protocol
                                          ;(require 'org-roam-protocol)
    (org-roam-setup)
    (org-roam-db-autosync-mode)
    :ensure t)
#+end_src

*** Undo tree
#+begin_src emacs-lisp :tangle yes
  (use-package undo-tree
    :config
    (global-undo-tree-mode)
    :ensure t)
#+end_src

*** Which-key
#+begin_src emacs-lisp :tangle yes
  (use-package which-key
    :if nil ; still testing
    :config
    (setq which-key-idle-delay 1)
    (setq which-key-idle-secondary-delay 0.05)
    (which-key-mode)
    :ensure t)
#+end_src

*** Helm
#+begin_src emacs-lisp :tangle yes
  (use-package helm
    :ensure t)
  (use-package helm-c-yasnippet
    :ensure t)
  (use-package helm-projectile
    :ensure t)
#+end_src

*** Restclient mode
#+begin_src emacs-lisp :tangle yes
  (use-package restclient
    :ensure t)
#+end_src

