init.el

(defun own/delete-current-buffer-file ()
  "Removes file connected to current buffer and kills buffer."
  (interactive)
  (let ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (if (not (and filename (file-exists-p filename)))
        (ido-kill-buffer)
      (when (yes-or-no-p "Are you sure you want to remove this file? ")
        (delete-file filename)
        (kill-buffer buffer)
        (message "File '%s' successfully removed" filename)))))
(defun own/rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
        (if (get-buffer new-name)
            (error "A buffer named '%s' already exists!" new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message "File '%s' successfully renamed to '%s'"
                   name (file-name-nondirectory new-name)))))))
(defun own/show-filename ()
  "Show the full path file name in the minibuffer."
  (interactive)
  (message (buffer-file-name)))

(defun own/google-search ()
  "Googles a query or region if any."
  (interactive)
  (browse-url
   (concat
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
    (if mark-active
        (buffer-substring (region-beginning) (region-end))
      (read-string "Google: ")))))
(defun own/goto-url ()
  "Open browser"
  (interactive)
  (browse-url 
	 (concat "http://" (read-string "URL: ") )))

(defun own/flatten (mylist)
  (cond
   ((null mylist) nil)
   ((atom mylist) (list mylist))
   (t
    (append (own/flatten (car mylist)) (own/flatten (cdr mylist))))))

(defun own/hook-mark-todo () 
  "A hook that sets bold reserved words FIXME, SIGITODO, TODO and BUG"
  (font-lock-add-keywords nil
                          '(("\\<\\(FIXME\\|SIGITODO\\|TODO\\|BUG\\):"
                             1 font-lock-warning-face t))))

(use-package auto-compile
  :init
  (auto-compile-on-load-mode 1)
  (auto-compile-on-save-mode 1)
  :ensure t)

(use-package selectrum
  :init
  (selectrum-mode +1)
  :ensure t)
(use-package prescient
  :ensure t)
(use-package selectrum-prescient
  :init
  (selectrum-prescient-mode +1) ; use prescient for minibuffer completion
  (prescient-persist-mode +1) ; remember favorite selections
  :after (selectrum prescient)
  :ensure t)

(use-package undo-tree
  :init
  (global-undo-tree-mode)
  :ensure t)

(use-package rg
  :config
  (grep-apply-setting 'grep-template "rg --no-heading -H -uu -g <F> <R> <D>")
  :ensure t)

(use-package expand-region
  :bind ("C->" . er/expand-region)
  :ensure t)

(use-package git-gutter
;    :if own/is-nox
    :init
    (global-git-gutter-mode +1)
    :ensure t)
;  (use-package git-gutter-fringe
;    :unless own/is-nox
;    :init
;    (global-git-gutter-mode +1)
;    :ensure t)

(use-package yasnippet
  :config
  ;(define-key yas-minor-mode-map (kbd "<tab>") nil)
  ;(define-key yas-minor-mode-map (kbd "TAB") nil)
  (setq yas-snippet-dirs (append (yas-snippet-dirs)
                                 own/yas-dirs))
  (yas/global-mode 1)
  :ensure t)

(use-package company
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  :ensure t)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :ensure t)

(use-package volatile-highlights
  :init
  (volatile-highlights-mode t)
  :ensure t)

(use-package doom-modeline
  :config
  (doom-modeline-mode 1)
  :ensure t)

(use-package flyspell-lazy
  :config
  (flyspell-lazy-mode 1)
  (flyspell-mode 1) 
  :ensure t)

(use-package multiple-cursors
  :bind (("C-S-c C-S-c" . mc/edit-lines)
         ("C-S-s" . mc/mark-next-like-this)
         ("C-S-r" . mc/mark-previous-like-this)
         ("C-S-a" . mc/mark-all-like-this))
  :ensure t)

(use-package projectile
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  :ensure t)

(use-package magit
  :bind ("C-x C-g" . magit-status)
  :ensure t)

(use-package org
  :mode ("\\.org$" . org-mode)
  :bind ("s-q o a" . org-agenda)
  :config
  (setq org-log-done t
        org-agenda-files (own/flatten (mapcar 'file-expand-wildcards (own/flatten own/org-agenda-files)))
        org-directory own/org-dir
        org-src-fontify-natively t)
  :ensure t)

(use-package org-roam
  :after org
  :if nil
  :custom
  (org-roam-directory (file-truename own/roam-dir))
  :bind ("s-q n" . hydra-roam/body)
  :hydra (hydra-roam (:color blue :hint nil :exit t)
                     ("b" org-roam-buffer-toggle "Toggle")
                     ("f" org-roam-node-find "Find")
                     ("g" org-roam-graph "Graph")
                     ("i" org-roam-node-insert "Insert")
                     ("c" org-roam-capture "Capture")

                     ("t" org-roam-dailies-capture-today "Capture today")
                     ("T" org-roam-dailies-goto-today "Today notes")
                     ("j" org-roam-dailies-capture-tomorrow "Capture tomorrow")
                     ("J" org-roam-dailies-goto-tomorrow "Tomorrow notes")
                     ("y" org-roam-dailies-capture-yesterday "Capture yesterday")
                     ("Y" org-roam-dailies-goto-yesterday "Yesterday notes")
                     ("d" org-roam-dailies-capture-date "Capture date")
                     ("D" org-roam-dailies-goto-date "Daily notes"))
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  ;; If using org-roam-protocol
                                        ;(require 'org-roam-protocol)
  (org-roam-setup)
  (org-roam-db-autosync-mode)
  :ensure t)

(use-package undo-tree
  :config
  (global-undo-tree-mode)
  :ensure t)

(use-package which-key
  :if nil ; still testing
  :config
  (setq which-key-idle-delay 1)
  (setq which-key-idle-secondary-delay 0.05)
  (which-key-mode)
  :ensure t)

(use-package helm
  :ensure t)
(use-package helm-c-yasnippet
  :ensure t)
(use-package helm-projectile
  :ensure t)

(use-package restclient
  :ensure t)
