init.org
* Programming
Flycheck for syntax checking.
#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :config
    (add-hook 'after-init-hook #'global-flycheck-mode)
    :ensure t)

#+end_src

Language Server Protocol

#+begin_src emacs-lisp :tangle yes
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook ((go-mode . lsp-deferred)
           (php-mode . lsp-deferred)
           (python-mode . lsp-deferred)
           (js2-mode . lsp-deferred)
           ;; (vue-mode . lsp-deferred)
           (lsp-mode . lsp-enable-which-key-integration))
    :bind ("s-x l" . hydra-lsp/body)
    :hydra (hydra-lsp (:color blue :hint nil :exit t)
                      ("f" lsp-format-buffer "Format buffer")
                      ("d" lsp-ui-peek-find-definitions "Find definitions")
                      ("r" lsp-ui-peek-find-references "Find references")
                      ("s" lsp-ui-peek-find-workspace-symbol "Find workspace symbol")
                      ("h" lsp-document-highlight "Document Highlight")
                      ("p" lsp-describe-thing-at-point "Describe @ p"))
    :config
    (setq lsp-disabled-clients '(vls))
    :commands lsp lsp-deferred
    :ensure t)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode :ensure t)
  ;; if you are helm user
  (use-package helm-lsp :commands helm-lsp-workspace-symbol :ensure t)

  ;; optionally if you want to use debugger
  ;; (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

#+end_src

** Python

Install stubs in cache:
git clone https://github.com/microsoft/python-type-stubs ~/.emacs.d/.cache/python-stubs
rm -r ~/.emacs.d/.cache/python-stubs/.git

LSP: pyright

#+begin_src emacs-lisp :tangle yes
  (use-package lsp-pyright
    :if own/enable-python
    :config
    (setq lsp-pyright-use-library-code-for-types t) ;; set this to nil if getting too many false positive type errors
    (setq lsp-pyright-stub-path (concat (getenv "HOME") "/.emacs.d/.cache/python-stubs")) ;; example
    :ensure t)
  (use-package python-mode
    :mode "\\.py\\'"
    :if own/enable-python
    :config
    (setq py-autopep8-options '("--max-line-length=120"))
    :ensure t)
#+end_src

** Go
go install golang.org/x/tools/gopls@latest

#+begin_src emacs-lisp :tangle yes
  (use-package go-mode
    :mode "\\.go\\'"
    :if own/enable-go
    :hook ((go-mode . (lambda ()
                        (add-hook 'before-save-hook #'lsp-format-buffer t t)
                        (add-hook 'before-save-hook #'lsp-organize-imports t t)
                        (setq tab-width 4))))
    :config
    (setq exec-path (cons "/usr/local/go/bin" exec-path))
    (add-to-list 'exec-path (concat own/go-path "/bin"))
    :ensure t)
#+end_src

** Lisp
#+begin_src emacs-lisp :tangle yes
  (use-package paredit
    :config
    (add-hook 'emacs-lisp-mode-hook #'paredit-mode)
    ;; enable in the *scratch* buffer
    (add-hook 'lisp-interaction-mode-hook #'paredit-mode)
    (add-hook 'ielm-mode-hook #'paredit-mode)
    (add-hook 'lisp-mode-hook #'paredit-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'paredit-mode)
    :ensure t)
#+end_src

** Javascript
LSP: typescript-language-server (pacman)
#+begin_src emacs-lisp :tangle yes
  (use-package js2-mode
    :if own/enable-js
    :mode "\\.js\\'"
    :config
    (setq js2-basic-offset 4)
    :ensure t)
#+end_src

*** Vue
https://azzamsa.com/n/vue-emacs/
LSP: volar-api

#+begin_src emacs-lisp :tangle yes
  (use-package vue-mode
    :if own/enable-js
    :mode "\\.vue\\'"
    :ensure t)
#+end_src

** PHP
LSP: iph

#+begin_src emacs-lisp :tangle yes
  (use-package php-mode
    :mode "\\.php\\'"
    :hook ((php-mode . php-enable-symfony2-coding-style))
    :if own/enable-php
    :ensure t)
#+end_src

** Web

** Everything else
#+begin_src emacs-lisp :tangle yes
  (use-package json-mode
    :mode "\\.json\\'"
    :ensure t)
  (use-package less-css-mode
    :mode "\\.less\\'"
    :ensure t)
  (use-package yaml-mode
    :mode "\\.ya?ml\\'"
    :custom
    (yaml-indent-offset 4)
    :ensure t)
#+end_src


* Keybindings

#+begin_src emacs-lisp :tangle yes
  (require 'bind-key)
#+end_src

** Buffers
#+begin_src emacs-lisp :tangle yes
  (bind-key "C-x C-k" 'own/delete-current-buffer-file)
  (bind-key "C-x C-r" 'own/rename-current-buffer-file)
  (bind-key "<f5>" 'rgrep)
  (bind-key "C-x C-b" 'ibuffer)
#+end_src

** Text
#+begin_src emacs-lisp :tangle yes
  (bind-key "s-u" 'undo)
#+end_src

** Tools
#+begin_src emacs-lisp :tangle yes
  (bind-key "<f5>" 'rgrep)
#+end_src

** Hydras
#+begin_src emacs-lisp :tangle yes
  (with-eval-after-load 'hydra
    (defhydra hydra-actions (:exit t)
      "Common actions"
      ("a" helm-mini "mini")
      ("p" helm-projectile "projectile"))
    (bind-key "s-a" 'hydra-actions/body)
    (defhydra hydra-buffer (:exit t)
      "Common actions"
      ("i" helm-imenu "imenu")
      ("o" helm-occur "occur")
      ("y" helm-yas-complete "yas")
      ("k" helm-show-kill-ring "kill ring"))
    (bind-key "s-y" 'hydra-buffer/body))
#+end_src

* Wrap up
#+begin_src emacs-lisp :tangle yes
  (if (fboundp 'menu-bar-mode) (menu-bar-mode t))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (when (and own/initial-buffer (file-exists-p own/initial-buffer))
    (setq initial-buffer-choice own/initial-buffer))
  (message "Initialization finished sucessfully")
#+end_src

