init.el

(use-package flycheck
  :config
  (add-hook 'after-init-hook #'global-flycheck-mode)
  :ensure t)

(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook ((go-mode . lsp-deferred)
         (php-mode . lsp-deferred)
         (python-mode . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration))
  :bind ("s-q l" . hydra-lsp/body)
  :hydra (hydra-lsp (:color blue :hint nil :exit t)
                    ("f" lsp-format-buffer "Format buffer")
                    ("d" lsp-ui-peek-find-definitions "Find definitions")
                    ("r" lsp-ui-peek-find-references "Find references")
                    ("s" lsp-ui-peek-find-workspace-symbol "Find workspace symbol")
                    ("h" lsp-document-highlight "Document Highlight")
                    ("p" lsp-describe-thing-at-point "Describe @ p"))
  :bind 
  :commands lsp lsp-deferred
  :ensure t)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode :ensure t)
;; if you are helm user
(use-package helm-lsp :commands helm-lsp-workspace-symbol :ensure t)

;; optionally if you want to use debugger
;; (use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

(use-package python-mode
  :mode "\\.py"
  :if own/enable-python
  :config
  (setq py-autopep8-options '("--max-line-length=120"))
  :ensure t)

(use-package go-mode
  :mode "\\.go$"
  :if own/enable-go
  :hook ((go-mode . (lambda ()
                      (add-hook 'before-save-hook #'lsp-format-buffer t t)
                      (add-hook 'before-save-hook #'lsp-organize-imports t t)
                      (setq tab-width 4))))
  :config
  (setq exec-path (cons "/usr/local/go/bin" exec-path))
  (add-to-list 'exec-path (concat own/go-path "/bin"))
  :ensure t)

(use-package paredit
  :config
  (add-hook 'emacs-lisp-mode-hook #'paredit-mode)
  ;; enable in the *scratch* buffer
  (add-hook 'lisp-interaction-mode-hook #'paredit-mode)
  (add-hook 'ielm-mode-hook #'paredit-mode)
  (add-hook 'lisp-mode-hook #'paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'paredit-mode)
  :ensure t)

(use-package php-mode
  :mode "\\.php$"
  :if own/enable-php
  :ensure t)

(use-package json-mode
  :mode "\\.json$"
  :ensure t)
(use-package less-css-mode
  :mode "\\.less$"
  :ensure t)
(use-package yaml-mode
  :mode "\\.ya?ml$"
  :custom
  (yaml-indent-offset 4)
  :ensure t)

(require 'bind-key)

(bind-key "C-x C-k" 'own/delete-current-buffer-file)
(bind-key "C-x C-r" 'own/rename-current-buffer-file)
(bind-key "<f5>" 'rgrep)
(bind-key "C-x C-b" 'ibuffer)

(bind-key "s-u" 'undo)

(bind-key "<f5>" 'rgrep)

(with-eval-after-load 'hydra
  (defhydra hydra-actions (:exit t)
    "Common actions"
    ("a" helm-mini "mini"))
  (bind-key "s-a" 'hydra-actions/body)
  (defhydra hydra-buffer (:exit t)
    "Common actions"
    ("i" helm-imenu "imenu")
    ("o" helm-occur "occur")
    ("y" helm-yas-complete "yas")
    ("k" helm-show-kill-ring "kill ring"))
  (bind-key "s-y" 'hydra-buffer/body))

(if (fboundp 'menu-bar-mode) (menu-bar-mode t))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(when (and own/initial-buffer (file-exists-p own/initial-buffer))
  (setq initial-buffer-choice own/initial-buffer))
(message "Initialization finished sucessfully")

